forms/Remessa Compras Delife/estrutura_faturamento.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.workflow.ecm.technology.totvs.com/">
   <soapenv:Header />
   <soapenv:Body>
      <ws:startProcessClassic>
         <username>EMAIL_USUARIO</username>
         <password>SENHA</password>
         <companyId>1</companyId>
         <processId>FaturamentoComprasOncoprod</processId>
         <choosedState>0</choosedState>
         <colleagueIds/>
         <comments/>
         <userId>ID_USUARIO</userId>
         <completeTask>true</completeTask>
         <attachments>
            <item>
               <attachmentSequence>1</attachmentSequence>
               <attachments>
                  <attach>true</attach>
                  <fileName>#NOME_ARQUIVO#</fileName>
                  <filecontent>#ARQUIVO_BASE64#</filecontent>
               </attachments>
               <companyId>1</companyId>
               <deleted>false</deleted>
               <description>#DESCRICAO_ANEXO#</description>
               <fileName>#NOME_ARQUIVO#</fileName>
               <newAttach>true</newAttach>
               <originalMovementSequence>0</originalMovementSequence>
               <version>1000</version>
            </item>
         </attachments>
         <cardData>
            <item>
               <key>nomeSolicitante</key>
               <value>Davi Pires de Castro</value>
            </item>
            <item>
                <key>idSolicitante</key>
                <value>ID_USUARIO</value>
            </item>
            <item>
                <key>dataSolicitacao</key>
                <value>22-11-2017</value>
            </item>
            <item>
                <key>codFilial</key>
                <value>01301</value>
            </item>
            <item>
                <key>filial</key>
                <value>CEON</value>
            </item>
             <item>
                <key>ufFilial</key>
                <value>RJ</value>
            </item>
             <item>
                <key>codFilialFluig</key>
                <value>07</value>
            </item>
            <item>
                <key>codFornecedor</key>
                <value>001948</value>
            </item>
            <item>
                <key>lojFornecedor</key>
                <value>01</value>
            </item>
            <item>
                <key>fornecedor</key>
                <value>CLARO S/A</value>
            </item>
            <item>
                <key>codCentroCusto</key>
                <value>11080102</value>
            </item>
            <item>
                <key>centroDeCusto</key>
                <value>INFRA</value>
            </item>
            <item>
                <key>infoAdicionais</key>
                <value>TESTE</value>
            </item>
            <item>
                <key>tabelaPreco</key>
                <value>REF. ABRIL/2017 - ICMS 20%</value>
            </item>
            <item>
                <key>prazoPagamento</key>
                <value>90 Dias</value>
            </item>
            <item>
                <key>localEntrega</key>
                <value>null</value>
            </item>
            <item>
                <key>prazoEntrega</key>
                <value>30-03-2018</value>
            </item>
              <item>
            <key>itemProd___1</key>
                <value>1</value>
            </item>
            <item>
                <key>numProd___1</key>
                <value>050081</value>
            </item>
            <item>
                <key>nomeProd___1</key>
                <value>ALKERAN 2 MG</value>
            </item>
            <item>
                <key>unidadeProd___1</key>
                <value>CP</value>
            </item>
            <item>
                <key>saldoAberto___1</key>
                <value>2</value>
            </item>
            <item>
                <key>inventarioProd___1</key>
                <value>1</value>
            </item>
            <item>
                <key>caixaProd___1</key>
                <value>1</value>
            </item>
            <item>
                <key>qtdProd___1</key>
                <value>25</value>
            </item>
            <item>
                <key>valorProd___1</key>
                <value>R$ 1,7256</value>
            </item>
            <item>
                <key>valorTotalProd___1</key>
                <value>R$ 43,14</value>
            </item>
            <item>
                <key>custoMensalProd___1</key>
                <value>2</value>
            </item>
            <item>
                <key>fabricanteProd___1</key>
                <value>GLAXOSMITHKLINE</value>
            </item>
            <item>
                <key>contaContabilProd___1</key>
                <value>110501010001</value>
            </item>
             <item>
                <key>valorTotal</key>
                <value>R$ 43,14</value>
            </item>
            <item>
                <key>grupoFilial</key>
                <value>Pool:Group:FARM_CEON</value>
            </item>
         </cardData>
         <appointment />
         <managerMode>0</managerMode>
      </ws:startProcessClassic>
   </soapenv:Body>
</soapenv:Envelope>